---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.Normal
source: html/d6ecbc19-e4dd-536c-b83a-1019b1663e04.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDrivenAccessor.Normal Property

A unit-length vector normal to the plane of the rebar

## Syntax (C#)
```csharp
public XYZ Normal { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.